## pandas tutorial

### Install libraries

In [ ]:
#pip install pandas
#pip install numpy

### import librarries

In [7]:
import pandas as pd
import numpy as np

In [9]:
# object creation
s = pd.Series([1,3,np.nan,5,7,8,9])
s

0    1.0
1    3.0
2    NaN
3    5.0
4    7.0
5    8.0
6    9.0
dtype: float64

In [14]:
dates = pd.date_range("20220801",periods=6)
dates

DatetimeIndex(['2022-08-01', '2022-08-02', '2022-08-03', '2022-08-04',
               '2022-08-05', '2022-08-06'],
              dtype='datetime64[ns]', freq='D')

In [15]:
df= pd.DataFrame(np.random.randn(6,4), index=dates,columns=list("ABCD"))
df

                   A         B         C         D
2022-08-01  1.212916  0.095080  0.034140  0.413459
2022-08-02 -2.086761 -0.579332  0.766701  0.969199
2022-08-03 -0.677928 -1.069500 -1.290587  0.532668
2022-08-04 -0.090825 -0.097610 -0.283428  0.498649
2022-08-05  1.238673  0.593164 -0.400958 -2.381267
2022-08-06  0.697889  0.020881  0.034826 -0.400442

In [21]:
df2 = pd.DataFrame(
    {
        "A": 1.0,
        "B": pd.Timestamp("20220419"),
        "C": pd.Series(1,index=list(range(4)),dtype="float32"),
        "D": np.array([3] * 4,dtype="int32"),
        "E": pd.Categorical(["girl","women","girl","women"]),
        "F": "females",
    }
)
df2

     A          B    C  D      E        F
0  1.0 2022-04-19  1.0  3   girl  females
1  1.0 2022-04-19  1.0  3  women  females
2  1.0 2022-04-19  1.0  3   girl  females
3  1.0 2022-04-19  1.0  3  women  females

In [23]:
df2.dtypes

A           float64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

In [25]:
df2.head(2)

     A          B    C  D      E        F
0  1.0 2022-04-19  1.0  3   girl  females
1  1.0 2022-04-19  1.0  3  women  females

In [26]:
df2.tail(2)

     A          B    C  D      E        F
2  1.0 2022-04-19  1.0  3   girl  females
3  1.0 2022-04-19  1.0  3  women  females

In [27]:
df2.index

Int64Index([0, 1, 2, 3], dtype='int64')

In [28]:
df.to_numpy()

array([[ 1.21291641,  0.09507972,  0.03413954,  0.41345924],
       [-2.08676093, -0.57933247,  0.76670082,  0.96919921],
       [-0.67792772, -1.06950021, -1.29058732,  0.53266756],
       [-0.09082531, -0.09760956, -0.28342801,  0.49864915],
       [ 1.23867317,  0.59316414, -0.40095796, -2.38126717],
       [ 0.69788879,  0.02088118,  0.03482573, -0.40044249]])

In [29]:
df2.to_numpy()

array([[1.0, Timestamp('2022-04-19 00:00:00'), 1.0, 3, 'girl', 'females'],
       [1.0, Timestamp('2022-04-19 00:00:00'), 1.0, 3, 'women',
        'females'],
       [1.0, Timestamp('2022-04-19 00:00:00'), 1.0, 3, 'girl', 'females'],
       [1.0, Timestamp('2022-04-19 00:00:00'), 1.0, 3, 'women',
        'females']], dtype=object)

In [30]:
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean   0.048994 -0.172886 -0.189885 -0.061289
std    1.288451  0.578095  0.675365  1.220732
min   -2.086761 -1.069500 -1.290587 -2.381267
25%   -0.531152 -0.458902 -0.371575 -0.196967
50%    0.303532 -0.038364 -0.124644  0.456054
75%    1.084160  0.076530  0.034654  0.524163
max    1.238673  0.593164  0.766701  0.969199

In [31]:
df.T

   2022-08-01  2022-08-02  2022-08-03  2022-08-04  2022-08-05  2022-08-06
A    1.212916   -2.086761   -0.677928   -0.090825    1.238673    0.697889
B    0.095080   -0.579332   -1.069500   -0.097610    0.593164    0.020881
C    0.034140    0.766701   -1.290587   -0.283428   -0.400958    0.034826
D    0.413459    0.969199    0.532668    0.498649   -2.381267   -0.400442

In [35]:
df.sort_index(axis=1,ascending=True)

                   A         B         C         D
2022-08-01  1.212916  0.095080  0.034140  0.413459
2022-08-02 -2.086761 -0.579332  0.766701  0.969199
2022-08-03 -0.677928 -1.069500 -1.290587  0.532668
2022-08-04 -0.090825 -0.097610 -0.283428  0.498649
2022-08-05  1.238673  0.593164 -0.400958 -2.381267
2022-08-06  0.697889  0.020881  0.034826 -0.400442

In [39]:
df.sort_values(by="B",ascending=True)

                   A         B         C         D
2022-08-03 -0.677928 -1.069500 -1.290587  0.532668
2022-08-02 -2.086761 -0.579332  0.766701  0.969199
2022-08-04 -0.090825 -0.097610 -0.283428  0.498649
2022-08-06  0.697889  0.020881  0.034826 -0.400442
2022-08-01  1.212916  0.095080  0.034140  0.413459
2022-08-05  1.238673  0.593164 -0.400958 -2.381267

In [40]:
df["D"]

2022-08-01    0.413459
2022-08-02    0.969199
2022-08-03    0.532668
2022-08-04    0.498649
2022-08-05   -2.381267
2022-08-06   -0.400442
Freq: D, Name: D, dtype: float64

In [42]:
#row wise selection
df[0:2]

                   A         B         C         D
2022-08-01  1.212916  0.095080  0.034140  0.413459
2022-08-02 -2.086761 -0.579332  0.766701  0.969199

In [43]:
df.loc[dates[5]]

A    0.697889
B    0.020881
C    0.034826
D   -0.400442
Name: 2022-08-06 00:00:00, dtype: float64

In [45]:
df.loc[:,["A","B"]]

                   A         B
2022-08-01  1.212916  0.095080
2022-08-02 -2.086761 -0.579332
2022-08-03 -0.677928 -1.069500
2022-08-04 -0.090825 -0.097610
2022-08-05  1.238673  0.593164
2022-08-06  0.697889  0.020881

In [49]:
df.loc["20220801":"20220803",["A","B","C"]]

                   A         B         C
2022-08-01  1.212916  0.095080  0.034140
2022-08-02 -2.086761 -0.579332  0.766701
2022-08-03 -0.677928 -1.069500 -1.290587

In [53]:
df.at[dates[2],"A"]

-0.677927723470068

In [54]:
df.iloc[1:4]

                   A         B         C         D
2022-08-02 -2.086761 -0.579332  0.766701  0.969199
2022-08-03 -0.677928 -1.069500 -1.290587  0.532668
2022-08-04 -0.090825 -0.097610 -0.283428  0.498649

In [55]:
df.iloc[0:5, 0:3]

                   A         B         C
2022-08-01  1.212916  0.095080  0.034140
2022-08-02 -2.086761 -0.579332  0.766701
2022-08-03 -0.677928 -1.069500 -1.290587
2022-08-04 -0.090825 -0.097610 -0.283428
2022-08-05  1.238673  0.593164 -0.400958

In [56]:
df[df["A"] > 0]

                   A         B         C         D
2022-08-01  1.212916  0.095080  0.034140  0.413459
2022-08-05  1.238673  0.593164 -0.400958 -2.381267
2022-08-06  0.697889  0.020881  0.034826 -0.400442

In [57]:
df[df > 0]

                   A         B         C         D
2022-08-01  1.212916  0.095080  0.034140  0.413459
2022-08-02       NaN       NaN  0.766701  0.969199
2022-08-03       NaN       NaN       NaN  0.532668
2022-08-04       NaN       NaN       NaN  0.498649
2022-08-05  1.238673  0.593164       NaN       NaN
2022-08-06  0.697889  0.020881  0.034826       NaN

In [68]:
df2 = df.copy()

In [70]:
df2["E"] = ["one", "one", "two", "three", "four", "three"]

In [71]:
df2

                   A         B         C         D      E
2022-08-01  1.212916  0.095080  0.034140  0.413459    one
2022-08-02 -2.086761 -0.579332  0.766701  0.969199    one
2022-08-03 -0.677928 -1.069500 -1.290587  0.532668    two
2022-08-04 -0.090825 -0.097610 -0.283428  0.498649  three
2022-08-05  1.238673  0.593164 -0.400958 -2.381267   four
2022-08-06  0.697889  0.020881  0.034826 -0.400442  three

In [74]:
df2["new"] = [1.2,2.2,3.3,4.4,5.5,6.6]
df2

                   A         B         C         D      E  new
2022-08-01  1.212916  0.095080  0.034140  0.413459    one  1.2
2022-08-02 -2.086761 -0.579332  0.766701  0.969199    one  2.2
2022-08-03 -0.677928 -1.069500 -1.290587  0.532668    two  3.3
2022-08-04 -0.090825 -0.097610 -0.283428  0.498649  three  4.4
2022-08-05  1.238673  0.593164 -0.400958 -2.381267   four  5.5
2022-08-06  0.697889  0.020881  0.034826 -0.400442  three  6.6

In [78]:
df3 = df2.iloc[:,0:4]
df3

                   A         B         C         D
2022-08-01  1.212916  0.095080  0.034140  0.413459
2022-08-02 -2.086761 -0.579332  0.766701  0.969199
2022-08-03 -0.677928 -1.069500 -1.290587  0.532668
2022-08-04 -0.090825 -0.097610 -0.283428  0.498649
2022-08-05  1.238673  0.593164 -0.400958 -2.381267
2022-08-06  0.697889  0.020881  0.034826 -0.400442